{
  "architectures": [
    "MaskFormerForInstanceSegmentation"
  ],
  "backbone_config": {
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "attention_probs_dropout_prob": 0.0,
    "bad_words_ids": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "depths": [
      2,
      2,
      18,
      2
    ],
    "diversity_penalty": 0.0,
    "do_sample": false,
    "drop_path_rate": 0.3,
    "early_stopping": false,
    "embed_dim": 192,
    "encoder_no_repeat_ngram_size": 0,
    "encoder_stride": 32,
    "eos_token_id": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 1536,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "image_size": 384,
    "in_channels": 3,
    "initializer_range": 0.02,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_norm_eps": 1e-05,
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "mlp_ratio": 4.0,
    "model_type": "swin",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_channels": 3,
    "num_heads": [
      6,
      12,
      24,
      48
    ],
    "num_layers": 4,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "patch_size": 4,
    "path_norm": true,
    "prefix": null,
    "pretrain_img_size": 384,
    "problem_type": null,
    "pruned_heads": {},
    "qkv_bias": true,
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "transformers_version": "4.17.0.dev0",
    "typical_p": 1.0,
    "use_absolute_embeddings": false,
    "use_bfloat16": false,
    "window_size": 12
  },
  "ce_weight": 1.0,
  "cross_entropy_weight": 1.0,
  "decoder_config": {
    "_name_or_path": "",
    "activation_dropout": 0.0,
    "activation_function": "relu",
    "add_cross_attention": false,
    "architectures": null,
    "attention_dropout": 0.0,
    "auxiliary_loss": false,
    "backbone": "resnet50",
    "bad_words_ids": null,
    "bbox_cost": 5,
    "bbox_loss_coefficient": 5,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "class_cost": 1,
    "cross_attention_hidden_size": null,
    "d_model": 256,
    "decoder_attention_heads": 8,
    "decoder_ffn_dim": 2048,
    "decoder_layerdrop": 0.0,
    "decoder_layers": 6,
    "decoder_start_token_id": null,
    "dice_loss_coefficient": 1,
    "dilation": false,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "dropout": 0.1,
    "early_stopping": false,
    "encoder_attention_heads": 8,
    "encoder_ffn_dim": 2048,
    "encoder_layerdrop": 0.0,
    "encoder_layers": 6,
    "encoder_no_repeat_ngram_size": 0,
    "eos_coefficient": 0.1,
    "eos_token_id": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "giou_cost": 2,
    "giou_loss_coefficient": 2,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "init_std": 0.02,
    "init_xavier_std": 1.0,
    "is_decoder": false,
    "is_encoder_decoder": true,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "mask_loss_coefficient": 1,
    "max_length": 20,
    "max_position_embeddings": 1024,
    "min_length": 0,
    "model_type": "detr",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_hidden_layers": 6,
    "num_queries": 100,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "position_embedding_type": "sine",
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "scale_embedding": false,
    "sep_token_id": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "transformers_version": "4.17.0.dev0",
    "typical_p": 1.0,
    "use_bfloat16": false
  },
  "dice_weight": 1.0,
  "fpn_feature_size": 256,
  "id2label": {
    "0": "wall",
    "1": "building",
    "2": "sky",
    "3": "floor",
    "4": "tree",
    "5": "ceiling",
    "6": "road, route",
    "7": "bed",
    "8": "window ",
    "9": "grass",
    "10": "cabinet",
    "11": "sidewalk, pavement",
    "12": "person",
    "13": "earth, ground",
    "14": "door",
    "15": "table",
    "16": "mountain, mount",
    "17": "plant",
    "18": "curtain",
    "19": "chair",
    "20": "car",
    "21": "water",
    "22": "painting, picture",
    "23": "sofa",
    "24": "shelf",
    "25": "house",
    "26": "sea",
    "27": "mirror",
    "28": "rug",
    "29": "field",
    "30": "armchair",
    "31": "seat",
    "32": "fence",
    "33": "desk",
    "34": "rock, stone",
    "35": "wardrobe, closet, press",
    "36": "lamp",
    "37": "tub",
    "38": "rail",
    "39": "cushion",
    "40": "base, pedestal, stand",
    "41": "box",
    "42": "column, pillar",
    "43": "signboard, sign",
    "44": "chest of drawers, chest, bureau, dresser",
    "45": "counter",
    "46": "sand",
    "47": "sink",
    "48": "skyscraper",
    "49": "fireplace",
    "50": "refrigerator, icebox",
    "51": "grandstand, covered stand",
    "52": "path",
    "53": "stairs",
    "54": "runway",
    "55": "case, display case, showcase, vitrine",
    "56": "pool table, billiard table, snooker table",
    "57": "pillow",
    "58": "screen door, screen",
    "59": "stairway, staircase",
    "60": "river",
    "61": "bridge, span",
    "62": "bookcase",
    "63": "blind, screen",
    "64": "coffee table",
    "65": "toilet, can, commode, crapper, pot, potty, stool, throne",
    "66": "flower",
    "67": "book",
    "68": "hill",
    "69": "bench",
    "70": "countertop",
    "71": "stove",
    "72": "palm, palm tree",
    "73": "kitchen island",
    "74": "computer",
    "75": "swivel chair",
    "76": "boat",
    "77": "bar",
    "78": "arcade machine",
    "79": "hovel, hut, hutch, shack, shanty",
    "80": "bus",
    "81": "towel",
    "82": "light",
    "83": "truck",
    "84": "tower",
    "85": "chandelier",
    "86": "awning, sunshade, sunblind",
    "87": "street lamp",
    "88": "booth",
    "89": "tv",
    "90": "plane",
    "91": "dirt track",
    "92": "clothes",
    "93": "pole",
    "94": "land, ground, soil",
    "95": "bannister, banister, balustrade, balusters, handrail",
    "96": "escalator, moving staircase, moving stairway",
    "97": "ottoman, pouf, pouffe, puff, hassock",
    "98": "bottle",
    "99": "buffet, counter, sideboard",
    "100": "poster, posting, placard, notice, bill, card",
    "101": "stage",
    "102": "van",
    "103": "ship",
    "104": "fountain",
    "105": "conveyer belt, conveyor belt, conveyer, conveyor, transporter",
    "106": "canopy",
    "107": "washer, automatic washer, washing machine",
    "108": "plaything, toy",
    "109": "pool",
    "110": "stool",
    "111": "barrel, cask",
    "112": "basket, handbasket",
    "113": "falls",
    "114": "tent",
    "115": "bag",
    "116": "minibike, motorbike",
    "117": "cradle",
    "118": "oven",
    "119": "ball",
    "120": "food, solid food",
    "121": "step, stair",
    "122": "tank, storage tank",
    "123": "trade name",
    "124": "microwave",
    "125": "pot",
    "126": "animal",
    "127": "bicycle",
    "128": "lake",
    "129": "dishwasher",
    "130": "screen",
    "131": "blanket, cover",
    "132": "sculpture",
    "133": "hood, exhaust hood",
    "134": "sconce",
    "135": "vase",
    "136": "traffic light",
    "137": "tray",
    "138": "trash can",
    "139": "fan",
    "140": "pier",
    "141": "crt screen",
    "142": "plate",
    "143": "monitor",
    "144": "bulletin board",
    "145": "shower",
    "146": "radiator",
    "147": "glass, drinking glass",
    "148": "clock",
    "149": "flag"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "label2id": {
    "animal": 126,
    "arcade machine": 78,
    "armchair": 30,
    "awning, sunshade, sunblind": 86,
    "bag": 115,
    "ball": 119,
    "bannister, banister, balustrade, balusters, handrail": 95,
    "bar": 77,
    "barrel, cask": 111,
    "base, pedestal, stand": 40,
    "basket, handbasket": 112,
    "bed": 7,
    "bench": 69,
    "bicycle": 127,
    "blanket, cover": 131,
    "blind, screen": 63,
    "boat": 76,
    "book": 67,
    "bookcase": 62,
    "booth": 88,
    "bottle": 98,
    "box": 41,
    "bridge, span": 61,
    "buffet, counter, sideboard": 99,
    "building": 1,
    "bulletin board": 144,
    "bus": 80,
    "cabinet": 10,
    "canopy": 106,
    "car": 20,
    "case, display case, showcase, vitrine": 55,
    "ceiling": 5,
    "chair": 19,
    "chandelier": 85,
    "chest of drawers, chest, bureau, dresser": 44,
    "clock": 148,
    "clothes": 92,
    "coffee table": 64,
    "column, pillar": 42,
    "computer": 74,
    "conveyer belt, conveyor belt, conveyer, conveyor, transporter": 105,
    "counter": 45,
    "countertop": 70,
    "cradle": 117,
    "crt screen": 141,
    "curtain": 18,
    "cushion": 39,
    "desk": 33,
    "dirt track": 91,
    "dishwasher": 129,
    "door": 14,
    "earth, ground": 13,
    "escalator, moving staircase, moving stairway": 96,
    "falls": 113,
    "fan": 139,
    "fence": 32,
    "field": 29,
    "fireplace": 49,
    "flag": 149,
    "floor": 3,
    "flower": 66,
    "food, solid food": 120,
    "fountain": 104,
    "glass, drinking glass": 147,
    "grandstand, covered stand": 51,
    "grass": 9,
    "hill": 68,
    "hood, exhaust hood": 133,
    "house": 25,
    "hovel, hut, hutch, shack, shanty": 79,
    "kitchen island": 73,
    "lake": 128,
    "lamp": 36,
    "land, ground, soil": 94,
    "light": 82,
    "microwave": 124,
    "minibike, motorbike": 116,
    "mirror": 27,
    "monitor": 143,
    "mountain, mount": 16,
    "ottoman, pouf, pouffe, puff, hassock": 97,
    "oven": 118,
    "painting, picture": 22,
    "palm, palm tree": 72,
    "path": 52,
    "person": 12,
    "pier": 140,
    "pillow": 57,
    "plane": 90,
    "plant": 17,
    "plate": 142,
    "plaything, toy": 108,
    "pole": 93,
    "pool": 109,
    "pool table, billiard table, snooker table": 56,
    "poster, posting, placard, notice, bill, card": 100,
    "pot": 125,
    "radiator": 146,
    "rail": 38,
    "refrigerator, icebox": 50,
    "river": 60,
    "road, route": 6,
    "rock, stone": 34,
    "rug": 28,
    "runway": 54,
    "sand": 46,
    "sconce": 134,
    "screen": 130,
    "screen door, screen": 58,
    "sculpture": 132,
    "sea": 26,
    "seat": 31,
    "shelf": 24,
    "ship": 103,
    "shower": 145,
    "sidewalk, pavement": 11,
    "signboard, sign": 43,
    "sink": 47,
    "sky": 2,
    "skyscraper": 48,
    "sofa": 23,
    "stage": 101,
    "stairs": 53,
    "stairway, staircase": 59,
    "step, stair": 121,
    "stool": 110,
    "stove": 71,
    "street lamp": 87,
    "swivel chair": 75,
    "table": 15,
    "tank, storage tank": 122,
    "tent": 114,
    "toilet, can, commode, crapper, pot, potty, stool, throne": 65,
    "towel": 81,
    "tower": 84,
    "trade name": 123,
    "traffic light": 136,
    "trash can": 138,
    "tray": 137,
    "tree": 4,
    "truck": 83,
    "tub": 37,
    "tv": 89,
    "van": 102,
    "vase": 135,
    "wall": 0,
    "wardrobe, closet, press": 35,
    "washer, automatic washer, washing machine": 107,
    "water": 21,
    "window ": 8
  },
  "mask_feature_size": 256,
  "mask_weight": 20.0,
  "model_type": "maskformer",
  "no_object_weight": 0.1,
  "num_attention_heads": 8,
  "num_hidden_layers": 6,
  "num_queries": 100,
  "torch_dtype": "float32",
  "transformers_version": null,
  "use_auxiliary_loss": false
}
